export type Level = "P1" | "P2" | "P3";

export const level: Level[] = ["P1", "P2", "P3"];

export const LevelMap = {
  P1: 3,
  P2: 4,
  P3: 5,
};

export const classMember: any = {
  吴彬: {
    YSQ1QHRG25113: ["孙明泽", "程梓豪", "胡亚凝", "陆屹"],
    YSQ1QHRG25066: ["叶成", "孙梓涵", "严格", "朱珺婷", "李滨桉", "殷家家"],
    YSQ1YBRG25075: ["李翔", "应钦洋", "余楚为", "付倍嘉"],
    YSQ1TGRG25202: ["郇来聪", "陈陶然", "	徐韵洁Sylvia"],
  },
  刘维倩: {
    LD250022V2: ["储芯宜", "刘怡然"],
    YSQ1QHRG25093: ["李璐", "王天立", "李诚俊", "郭珈言", "韩司南", "邓越"],
    YSQ1JCRG25073: [
      "谢佳胤",
      "Cindy夏欣怡",
      "张荷磬",
      "郦晓鑫",
      "范子乔",
      "刘子越",
      "林俊桦",
    ],
  },
  董洁: {
    YSQ2JCRG24152: [
      "李滨桉",
      "方明恺",
      "陆奕鳞",
      "张涵",
      "韩译瑶",
      "彭炜宸",
      "钟赡予",
      "蔡烨然",
    ],
    YSQ2TGRG24169U: [
      "范诗琦",
      "郑子杰",
      "田保鑫",
      "江伊婷",
      "殷樱",
      "张涵骏",
      "张卜豪",
      "陈歆赟",
      "赵依黎",
    ],
    YSQ3YBRG2304: [
      "周士钦",
      "莫鑫楠",
      "陈思源",
      "范思晟",
      "杨伊涵",
      "毛欣霆",
      "宋慧仪",
      "战嘉",
      "余润泽",
      "李嘉乐",
    ],
    YSQ1TGRG24125U: ["陈铭馨", "郑翔文", "沈嘉伟", "杨妍婷", "顾昊霖"],
    YSQ2QHRG24231U: [
      "江伊婷",
      "包天琦",
      "张卜豪",
      "陈欣赟",
      "俞心洁",
      "周骏杰",
      "陈哲宇",
      "郑煜",
      "许雪儿",
    ],
    YSQ1YBRG24215: ["鲍凯琛", "郑伊辰", "钱欣妍", "徐秦瑜涵", "徐安娜"],
    YSQ2JCRG24160: ["吴熠凡", "戴子涵", "茅欣远", "丁小峰", "叶昕媛", "朱啸宇"],
  },
  王南飞: {
    YSQ2QHRG25255: [
      "沈芯婷",
      "代贝贝",
      "邬婷竹",
      "丁子诺",
      "庄子墨",
      "李卓婷",
      "杨卓尔",
      "邹皓辰",
    ],

    ALCHRG25041: ["王涵一 ", "马蕴洁", "沈奕博"],

    YSQ2CCRG25193: [
      "张睿麒",
      "丁小峰",
      "严汝鋆",
      "张子姚",
      "王韵涵",
      "吴欣纯",
      "庄嘉琦",
      "赵冯轩",
    ],

    YSQ2QHRG25239: [
      "邵子桐",
      "丁小峰",
      "王莉雯",
      "李冰玉",
      "石煦然",
      "毛悠然",
      "董姝晴",
      "王思源",
    ],

    YSQ2JCRG25139: [
      "汤维超",
      "韦懿玲",
      "倪可安",
      "史宜婷",
      "薛梓寅",
      "戴煜佳",
      "黄奕诚",
      "瞿思颖",
    ],

    YSQ2JCRG25132: [
      "汤维超",
      "陈若澜",
      "姚清时",
      "吴熠凡",
      "李溢米",
      "刘子洋",
      "黄奕诚",
      "郭若楠",
    ],
  },
  江玥彤: {
    YSQ1QHRG25201: ["陈陶然", "施盛元", "谢知言", "家旭"],
    YSQ2QHRG25238: [
      "丁嘉俊",
      "杜昱",
      "杨千惠",
      "李佳琦",
      "胡小满",
      "蔡昱宸",
      "王欣程",
      "王梓涵",
    ],
  },
};
