export type Level = "P1" | "P2" | "P3";

export const level: Level[] = ["P1", "P2", "P3"];

export const LevelMap = {
  P1: 3,
  P2: 4,
  P3: 5,
};

export const classMember: any = {
  吴彬: {
    YSQ1QHRG25113: ["孙明泽", "程梓豪", "胡亚凝", "陆屹"],
    YSQ1QHRG25066: ["叶成", "孙梓涵", "严格", "朱珺婷", "	殷家家"],
    YSQ1YBRG25075: ["李翔", "应钦洋", "余楚为", "付倍嘉"],
    YSQ1TGRG25202: ["郇来聪", "陈陶然", "	徐韵洁Sylvia"],
  },
  刘维倩: {
    LD250022V2: ["储芯宜", "刘怡然"],
    YSQ1QHRG25093: ["李璐", "王天立", "李诚俊", "郭珈言", "韩司南", "邓越"],
    YSQ1JCRG25073: [
      "谢佳胤",
      "Cindy夏欣怡",
      "张荷磬",
      "郦晓鑫",
      "范子乔",
      "刘子越",
      "林俊桦",
    ],
  },
  董洁: {
    YSQ2JCRG24152: [
      "李滨桉",
      "方明恺",
      "陆奕鳞",
      "张涵",
      "韩译瑶",
      "彭炜宸",
      "钟赡予",
      "蔡烨然",
    ],
    YSQ2TGRG24169U: [
      "范诗琦",
      "郑子杰",
      "田保鑫",
      "江伊婷",
      "殷樱",
      "张涵骏",
      "张卜豪",
      "陈歆赟",
      "赵依黎",
    ],
    YSQ3YBRG2304: [
      "周士钦",
      "莫鑫楠",
      "陈思源",
      "范思晟",
      "杨伊涵",
      "毛欣霆",
      "宋慧仪",
      "战嘉",
      "余润泽",
      "李嘉乐",
    ],
    YSQ1TGRG24125U: ["陈铭馨", "郑翔文", "沈嘉伟", "杨妍婷", "顾昊霖"],
    YSQ2QHRG24231U: [
      "江伊婷",
      "包天琦",
      "张卜豪",
      "陈欣赟",
      "俞心洁",
      "周骏杰",
      "陈哲宇",
      "郑煜",
      "许雪儿",
    ],
    YSQ1YBRG24215: ["鲍凯琛", "郑伊辰", "钱欣妍", "徐秦瑜涵", "徐安娜"],
    YSQ2JCRG24160: ["吴熠凡", "戴子涵", "茅欣远", "丁小峰", "叶昕媛", "朱啸宇"],
  },
  王南飞: {
    YSQ1TGRG25086: [
      "刘佳梦",
      "许言若",
      "庄子墨",
      "吴戟",
      "沈思若",
      "刘苏晨",
      "杭沪宁",
      "朱江欣",
    ],
    YSQ1JCRG25115: ["易永翰", "葛子皓", "李冰玉", "高语泽"],
  },
  柯雨婷: {
    YSQ1JCRG25115: ["易永翰", "李冰玉", "葛子皓", "高语泽"],
    YSQ1TGRG25087: ["高圣研", "李卓婷", "肖慧茹", "赵千惠", "程弋洋"],
  },
};
